const cn = {
    title: "监控系统",
    position:{
        location: "位置"
    },

    login_cpms:{
        watch:"监控系统>>",
        useName_placeholder:"请输入用户名",
        password_placeholder:"请输入密码",
        keeplogin_value:"7天内免登录",
        Vcode:"请输入验证码",
        login_button_value:"登录",
        tech_support_value:"技术支持",
        prod_info_value:"产品信息",

        /*技术支持 弹窗的按钮 以及内容*/
        tech_support:"技术支持>>",
        tech:{
            tS_company:"广东大榕树信息科技有限公司",
            tS_tel:"电  话:",
            tS_email:"邮  箱:",
            tS_qq: "Q Q :"
        },

        /*产品信息 弹窗的按钮 以及内容*/
        prod_info:"产品信息>>",
        prod:{
            pr_starData:"起始日期:",
            pr_numDevices:"设备总数:",
            pr_activeStatus:"激活状态:",
            pr_Serial:"序列号:",
            pr_activeCode:"激活码:",
        },
        Activate_btn:"激活",

        username_prompt: "请输入用户名",
        password_prompt: "请输入密码",
        code_prompt: "请输入验证码"
    },
    footer_cpms:{
        name:"广东大榕树信息科技有限公司",
        sname:"监控系统",
    },
    index:{
        nav:{
            name01:"总览",
            name02:"机房能耗",
            name03:"数据列表",
            name04:"故障处理",
            name05:"日志",
            name06:"设置",
            name07:"帮助文档",
        },
    },
    /**表格最大值,最小值,平均值 **/
    dataTable: {
        maximum: "最大值",
        minimum: "最小值",
        average: "平均值",
        
        excel_alt: "导出Excel表格",

        /** 数据格式化 翻译部分 **/
        column_device_status:{
            status1: "未就绪",
            status2: "运行",
            status4: "宕机",
            status8: "不可达",
        },
        column_service_status:{
            status1: "未就绪",
            status2: "正常",
            status4: "警报",
            status8: "未知",
            status16: "严重",
        },

        column_userType: {
            type1: "超级管理员",
            type2: "操作员",
            type3: "查看员"
        }
    },
    /**总览页面 */
    overview:{
        sec_one:{
            ht:"设备项与监控项数量",
            large_left:"设备项",
            large_right:"监控项",
            normal_small:"正常项",
            Exception_small:"异常项",
        },
        sec_two:{
            ht:"设备项与监控项故障比率",
            left:"设备项",
            right:"监控项",
            legend_one:"正常率",
            legend_two:"异常率",
        },
        sec_three:{
            ht:"近期环境曲线",
            sT01:"4小时",
            sT02:"24小时",
            sT03:"一周",
            sT04:"一个月",
            sT05:"一年"
        },
        sec_four:{
            ht:"报警项列表>>",
            sH01:"设备",
            sH02:"监控项",
            sH03:"状态",
            sH04:"信息",
            sH05:"时间",
        },
    },
    /** 机房能耗 **/
    energy:{
        ht:{
            sec_one: "瞬时PUE",
            sec_two: "用电比例图",
            sec_three: "设备用电量曲线",
            sec_four: "PUE能耗分析"
        },
        sec_two:{
            legend1: "IT设备功率值",
            legend2: "物理基础设备",

            prompt1: "访问来源",
        },
        excel: "导出Excel",
    },
    /** 数据列表 &  故障处理**/
    dataSheets: {
        search_btn: "搜索",

        option1: {
            op1: "未就绪",
            op2: "运行",
            op3: "宕机",
            op4: "不可达"
        },

        option2: {
            op1: "未就绪",
            op2: "正常",
            op3: "警报",
            op4: "未知",
            op5: "严重",
        },

        option3: {
            op1: "未处理",
            op2: "已处理"
        },

        control:{
            label1: "确认设备报警",
            label2: "移除已确认设备报警",
            label3: "启用设备报警",
            label4: "禁用设备报警",
            label5: "启用设备所有监控项报警",
            label6: "禁用设备所有监控项报警",

            label7: "确认监控项报警",
            label8: "移除已确认监控项报警",
            label9: "启用监控项报警",
            label10: "禁用监控项报警",
        },
        
        device: {
            name: "设备",
            selectP: "请选择设备状态",
            input1: "请输入设备名称",

            table:{
                th1: "设备名称",
                th2: "状态",
                th3: "最近检查",
                th4: "持续时间",
                th5: "报警缓冲",
                th6: "信息",
            }
        },
        monitoring: {
            name: "监控项",
            selectP: "请选择监控项状态",
            input1: "请输入设备名称",
            input2: "请输入监控项名称",

            table: {
                th1: "设备名称",
                th2: "监控项",
                th3: "状态",
                th4: "最近检查",
                th5: "持续时间",
                th6: "报警缓冲",
                th7: "信息",
            }
        }
    },
    /** 日志 **/
    log:{
        select: "请选择搜索类型",
        input1: "请输入搜索内容",
        input2: "过滤参数, 以*号连接",

        search_btn: "搜索",

        option1:{
            op1: "今天",
            op2: "最近24小时",
            op3: "本周",
            op4: "最近一周",
            op5: "本月",
            op6: "最近一月",
            op7: "本年",
            op8: "最近一年",
            op9: "自定义",
        },

        option2: {
            op1: "用户名",
            op2: "客户端IP",
            op3: "客户端类型",
            op4: "客户端平台",
            op5: "动作标识",
            op6: "备注",
        },
        
        table:{
            th1: "时间",
            th2: "用户名",
            th3: "用户类型",
            th4: "客户端IP",
            th5: "客户端类型",
            th6: "客户端平台",
            th7: "动作标识",
            th8: "备注",
        },

        table2: {
            th1: "时间",
            th2: "日志类型",
            th3: "联系人名称",
            th4: "设备名称",
            th5: "监控项名称",
            th6: "触发时的状态",
            th7: "执行的命令",
            th8: "详细信息",
        },

        table3: {
            th1: "时间",
            th2: "日志类型",
            th3: "设备名称",
            th4: "触发的监控项",
            th5: "触发时的状态",
            th6: "尝试次数",
            th7: "详细信息",
        }
    },
    /** 设置 **/
    set:{
        name1: "设备管理",
        name2: "人员管理",
        name3: "时间管理",
        name4: "端口管理",
        name5: "应用管理",
        name6: "更多管理",

        set1: {
            describe1: "修改背景图,参数",
            describe2: "监控项上下限等",
        },
        set2: {
            describe1: "管理监控设备出现报警时",
            describe2: "需要通知的联系人",
        },
        set3: {
            describe1: "手动管理服务器时间以",
            describe2: "保持时间准确",
        },
        set4: {
            describe1: "更改服务器自带的硬件",
            describe2: "串口参数",
        },
        set5: {
            describe1: "将缓存中的设置应用到程序中",
            describe2: "并重启程序使设置生效",
        },
        set6: {
            describe1: "关闭或重启服务器",
        }
    },
    /** 具体设备监控详情页 **/
    widget:{
        excel_alt: "导出Excel",
        search_btn: "搜索",
        tab0:{
            name: "仪表显示",
            title: "近期环境曲线",
            sT01:"4小时",
            sT02:"24小时",
            sT03:"一周",
            sT04:"一个月",
            sT05:"一年"
        },
        tab1:{
            name: "监控项",
            select:{
                option1: "未就绪",
                option2: "运行",
                option3: "警报",
                option4: "未知",
                option5: "严重",
            },
            placeholder: "请输入监控项名称",
            placeholder2: "请选择",
            table: {
                th1: "监控项",
                th2: "状态",
                th3: "最近检查",
                th4: "持续时间",
                th5: "报警缓冲",
                th6: "信息",
            }
        },
        tab2:{
            name: "设备报警日志",
            select: {
                option1: "今天",
                option2: "本周",
                option3: "本月",
                option4: "本年",
                option5: "自定义",
            },
            placeholder: "过滤参数, 以*号连接",
            table: {
                th1: "时间",
                th2: "触发的监控项",
                th3: "触发时的状态",
                th4: "日志标识",
                th5: "尝试次数",
                th6: "详细信息",
            }
        },
        tab3:{
            name: "设备通知日志",
            select: {
                option1: "今天",
                option2: "本周",
                option3: "本月",
                option4: "本年",
                option5: "自定义",
            },
            table:{
                th1: "时间",
                th2: "触发的监控项",
                th3: "联系人名称",
                th4: "触发时的状态",
                th5: "执行的命令",
                th6: "详细信息",
            }
        },
        tab4: {
            name: "数据曲线",
            select: {
                option1: "4小时",
                option2: "24小时",
                option3: "一周",
                option4: "一个月",
                option5: "一年",
                option6: "自定义",
            },
        }
    },
    /** 监控项,设备项 弹框的翻译 **/
    service_dialog:{
        title: "命令>>",
        object: "操作对象",
        device: "设备",
        service: "监控项",
        order: "命令",

        remarks: "备注",
        required: "此项为必填项",
        overdue: "使用逾期时间",
        overdue_placeholder: "选择日期时间",

        define_btn: "确定",
        cancel_btn: "取消",

        prompt1: "确认设备报警",
        prompt2: "移除已确认设备报警",
        prompt3: "启用设备报警",
        prompt4: "禁用设备报警",
        prompt5: "启用设备所有监控项报警",
        prompt6: "禁用设备所有监控项报警",

        prompt7: "确认监控项报警",
        prompt8: "移除已确认监控项报警",
        prompt9: "启用监控项报警",
        prompt10: "禁用监控项报警",
      
    },
    /* 设置内页 */
    // 表格操作按钮：新增、删除、修改；表格的表头
    Table: {
        Operate_Btn_list: ["新增","删除","保存","批量管理","修改","发送邮箱设置","测试","对比","日志","应用","批量管理"],
        hostGroup: {
            tableTH:["机房组名称", "设备", "更多"]
        },

        devices: {
            tableTH: ["设备名称", "机房组", "联系人组", "分类", "驱动", "IP地址", "端口", "RS485", "被动连接", "被动连接注册包", "监控项", "更多"],
            filter_label: ["机房", "查询类别", "设备名称", "设备驱动", "设备IP"],
            filter_btn: ["搜索"]
        },
        monitoring: {
            tableTH: ["监控项名称", "联系人组", "监控项ID", "检查命令", "脚本", "更多"],
            checkOrder_label: ["级报警", "2级报警"]
        },
        user: {
            data:["超级管理员", "操作员", "查看员"],
            tableTH: ["用户名", "用户类型", "机房组", "联系人组"]
        },
        contactGroup: {
            tableTH: ["名称","联系人"]
        },
        contacts: {
            tableTH: ["名称","联系人组","邮箱地址","语音接收号码","短信接收号码","定时通知","更多"]
        },
        period: {
            tableTH: ["名称","别名","星期一","星期二","星期三","星期四","星期五","星期六","星期天"]
        },
        ports: {
            data: ["无", "偶校验", "奇校验"],
            tableTH: ["串口名称", "串口设备名称", "串口波特率", "数据位", "停止位", "校验方式", "侦听TCP端口"]
        },
        leftMenu: {
            data: ["主框架打开","新标签打开"],
            tableTH: ["名称", "设备组", "分类", "链接", "目标"]
        },
        timedTask: {
            data: ["星期一", "星期二","星期三","星期四","星期五","星期六","星期日", "定时任务"],
            tableTH: ["名称", "创建者", "执行时间", "执行周期/日期", "上一次执行者","上一次完成状态","上一次完成时间","启用状态","命令"]
        },
        forward: {
            data: ["新建参数"],
            tableTH: ["名称", "类型", "IP/域名地址", "端口", "编号"]
        },
        linkage: {
            tableTH: ["名称", "设备","监控项","工作值","阈值","备注","越限命令","恢复命令"] 
        },
        Box: {
            Delete:{
                title: "提示",
                content: "删除后不可恢复，点击”确认“后生效。是否确认？",
                tips: [
                    // 提示空的
                    "请选择您要删除的对象"
                ],
            },
            Add: {
                hostGroup: {
                    data: "新增机房"
                },
                device: {
                    btn: ["加入", "移除"],
                    title: "设备新增>>",
                    table_th: ["名称","数量","关联命令","机房组","联系人组"],
                    tips: [
                        // 提示空的联系人
                        "您必须为每个设备，勾选至少一个联系人组，如还未有联系人组，请先创建一个!"
                    ],
                    selNotification: {
                        title: "选择设备命令",
                        table_td: ["关联命令"]
                    }
                },
                user: {
                    title: "新增弹框>>",
                    label: [
                        "用户名",
                        "用户类型",
                        "机房组",
                        "联系人组",
                        "输入密码",
                        "确认密码",
                        "修改密码",
                        "输入旧密码",
                        "输入新密码",
                        "确认新密码",
                    ],
                    placeholder: [
                        "请输入用户名",
                        "密码长度为6-20位，由字母+数字组成",
                        "请保持两次密码输入一致"
                    ],
                    option: ["所有机房", "所有联系人", "超级管理员","操作员","查看员"],
                    tips: ["两次输入的密码不一致"]
                },
                contactGroup: {
                    data: "新增联系人组",
                    title: "选择联系人组>>",
                    tips: ["您必须勾选至少一个联系人组，如还未有联系人组，请先创建一个!"]
                },
                contacts: {
                    data: "新建联系人"
                },
                forward: {
                    title: "新增转发参数>>",
                    label: ["名称", "类型", "IP/域名地址", "端口", "编号"],
                    option: ["门禁", "视频"],
                    placeholder: [
                        "请输入名称",
                        "请输入IP域名地址",
                        "请输入端口号",
                        "请输入编号"
                    ]
                },
            },
            Batch: {
                title: "批量管理>>",
                device: {
                    label: ["复制对象", "参考对象", "应用对象"],
                    batchTemp: ["机房组","联系人组","分类","IP地址","端口","RS485地址"]
                },
                monitoring: {
                    label: ["复制参数", "参考对象", "应用对象"],
                    batchTemp: ["联系人组", "检查间隔", "重试间隔", "通知间隔", "启用间隔"]
                }
            },
            Email: {
                contacts: {
                    title: "发送邮箱设置>>",
                    label: ["邮箱地址", "邮箱密码", "SMTP地址"],
                    tips: [
                        "请输入s完整的邮箱地址",
                        "密码", 
                        "SMTP邮箱服务器，如stmp.126.com",
                        "*注意， 点击“测试”按钮可验证输入的邮箱账号密码是否正确"
                    ],
                    btn: ["测试", "保存"]
                }
            },
            Cell: {
                device: {
                    editContactGroups_title: "选择联系人组>>",
                    more: {
                        title: "设备更多参数",
                        label: ["检查间隔","重复次数","检查时间段",
                        "通知时间段","通知间隔","启用通知", "使用Zigbee", 
                        "物理地址", "最大缓存", "协议版本", "SNMP团队名",
                        "SNMP版本号", "超时值"],
                        unit: ["秒", "次", "时", "分"]
                    }
                },
                monitoring: {
                    editContactGroups_title: "选择联系人组>>",
                    editCheckOrder: {
                        title: "检查命令",
                        label: ["1级报警", "级报警"],
                        label2: ["最小值", "最大值"],
                        tips: ["无可修改的参数！"]
                    },
                    more: {
                        title: "更多参数",
                        label: ["检查间隔","重复次数","检查时间段",
                        "通知时间段","通知间隔","启用通知", "使用Zigbee", 
                        "物理地址", "最大缓存", "协议版本", "SNMP团队名",
                        "SNMP版本号", "超时值"],
                        unit: ["秒", "次", "时", "分"]
                    }
                },
                contacts: {
                    editContactGroups_title: "选择联系人组>>",
                    timedNoti: {
                        title: "定时通知>>",
                        option: [
                            "开启",
                            "每天", "每隔2天","每隔3天","每隔4天","每隔5天","每隔6天", "每隔7天",
                        ]
                    },
                    more: {
                        title: "更多参数",
                        tab: ["设备", "监控项"],
                        label: ["开启通知","通知时间段","通知选项","通知命令"],
                        option: ["宕机", "不可达", "恢复", "抖动", "宕机期间", "警告", "严重", "未知", "恢复", "抖动"]
                    }
                },
                timedTask: {
                    cycle: {
                        title: "执行周期>>",
                        select: ["每周循环", "单次执行"],
                        option: [
                            "星期一",
                            "星期二",
                            "星期三",
                            "星期四",
                            "星期五",
                            "星期六",
                            "星期日",
                        ]
                    },
                    order: {
                        title: "命令>>",
                        table_th: ["名称", "设备", "命令"]
                    }
                },
                Period: {
                    title: "时间段设置>>",
                    btn: ["确定", "新增", "取消"],
                    other: "至"
                },
            },
            log: {
                timedTask: {
                    title: "任务日志>>",
                    table_th: ["时间", "类型", "内容"],
                    btn: ["确认"],
                    tips: ["请先勾选需要查看的任务"]
                }
            },
            comcontrast: {
                timedTask: {
                    label: [
                        "任务创建时间",
                        "任务创建用户",
                        "上一次执行的用户",
                        "上一次执行的时间",
                        "上一次完成的时间",
                        "上一次完成的状态",
                        "任务执行时间",
                        "任务执行日期（单次执行时）",
                        "是否重复",
                        "任务执行周期",
                        "任务当前状态"
                    ],
                    tips: [
                        "请选择至少两项进行对比"
                    ]
                }
            },
            modify: {
                title: "修改弹框>>",
                tips: [
                    "请选择要修改的联动参数",
                    "请选择要修改的用户",
                    "请选择要修改的外部链接"
                ]
            }
        }
    },
    mDevice: {
        tabTitle:["设置", "机房组", "设备", "监控项"],
    },
    mPersonnel: {
        tabTitle:["设置", "登录用户", "联系人组", "联系人"]
    },
    mTime: {
        tabTitle: ["设置", "服务器时间", "时间段"],
        label:["服务器时间", "设置时间"],
        btn: "保存"
    },
    mApplication: {
        tabTitle: ["设置", "应用设置"],
        btn: "执行",
        Box: {
            title: "应用设置>>",
            content: "确定将修改内容应用到后台服务，使其生效？"
        }
    },
    mPorts: {
        tabTitle: ["设置", "网络接口", "硬件串口"],
        label: [
            "请选择您要设置的网络接口",
            "信息", "接口", "活动", "字节", "数据包", "错误", "已发送", "已接收", "DNS1", "DNS2"
        ],
        title: ["常规设置", "IPv4设置"],
        Btn_list: ["保存", "新增", "删除"],
        son_table_th: ["IP地址", "子网掩码", "网关"]
    },
    mMore: {
        
        tabTitle: ["设置", "全局参数", "后台服务", "备份还原", "左边栏菜单", "网页报警", "定时任务","能耗参数","转发参数", "联动参数", "软件信息"],
        
        globalPara:{
            label: [
                "记录被动检查",
                "记录设备重试",
                "记录通知事件",
                "记录监控项重试",
                "启用通知",
                "启用抖动识别",
                "设备检查抖动解除门限值（%）",
                "监控项检查抖动解除门限值（%）",
                "设备检查抖动开始门限值（%）",
                "监控项检查抖动开始门限值（%）",
                "时间单位（秒）",
                "通知超时（秒）",
                "设备检查超时（秒）",
                "监控项检查超时（秒）",
                "非法字符",
            ],
            text: [
                "在日志中记录被动检查的状态",
                "在日志中记录设备重试的状态信息",
                "在日志中记录通知事件",
                "在日志中记录监控项重试的状态信息",
                "此参数决定了当设备或监控项的状态发生变化时是否执行通知动作",
                "启用该项参数可以防止通知风暴，即监控对象的测量值在门限值附近来回波动造成大量的通知动作。",
                "设备检查抖动解除门限值，低于这一数值时意味着设备的抖动状态将解除，该设备对应的通知功能重新恢复（勾选启用抖动识别后才有效）。",
                "监控项检查抖动解除门限值，低于这一数值时意味着设备的抖动状态将解除，该监控项对应的通知功能重新恢复（勾选启用抖动识别后才有效）。",
                "设备检查抖动开始门限值，超过这一数值时意味着设备进入抖动状态，该设备对应通知功能被禁用（勾选启用抖动识别后才有效）。",
                "监控项检查抖动开始门限值，超过这一数值时意味着设备进入抖动状态，该监控项对应通知功能被禁用（勾选启用抖动识别后才有效）。",
                "所有的间隔以此为单位，即：如果设备的检查间隔是3，那么实际时间是3再乘以时间单位（默认是10秒）等于30秒，注意：减小此参数值会增加系统负载，反之则会减轻负载。（慎用）",
                "当发送通知的命令执行超过这一数值时，该通知命令将被终止",
                "当设备检查命令的执行时间超过这一数值时，该命令将被终止",
                "当监控项检查命令的执行时间超过这一数值时，该命令将被终止并返回预先设定的监控项超时后的状态。",
                "所有名称中不能包含有任意一个其中的字符",
                
                "注释：1.抖动识别原理: 后台程序会分析每个设备或监控项最近21次的检查状态,也就是最多有20次的状态变化,当状态变化次数除以20换算成百分比超过设定的抖动开始门限时, 关于该设备或监控项的通知将被禁止发送,直到该设备或监控项的状态变化次数除以20换算成百分比低于设定的抖动停止门限后该通知才会恢复。"
            ],
            btn: "保存"
        },

        Backstage: {
            label: ["请选择您要设置的后台服务", "请选择您要设置的开关机状态"],
            option: ["清除缓存", "启用后台服务", "停止后台服务", "关机", "重启"],
            btn: "执行",
            Prompt: {
                content:  [
                    {
                        title: "清除缓存",
                        text: "点击确定后将进行缓存的清除，是否继续？"
                    },
                    {
                        title: "启动后台服务",
                        text: "点击确定后将启动后台服务，是否继续？"
                    },
                    {
                        title: "停止后台服务",
                        text: "点击确定后将停止后台服务，是否继续？"
                    },
                    {
                        title: "关机",
                        text: "点击确定后将执行服务器关机，是否继续？"
                    },
                    {
                        title: "重启",
                        text: "点击确定后将执行服务器重启，是否继续？"
                    },
                ],
                btn: ["确定", "取消"]
            },
            tips: [
                "权限不足或用户验证已超时，请重新登录",
                "发生错误："
            ],
            import_drive:{
                title: "驱动导入>>",
                option: "替换已存在的驱动"
            }
        },

        leftMenu: {
            Prompt: {
                title: ["新增外部链接>>", "修改链接>>"],
                label: ["名称","链接地址","打开方式","分类名称","所属设备组"],
                placeholder: [
                    "请输入外部链接的名称",
                    "请输入外部链接的地址",
                    "请输入分类名称",
                ],
                select_opt: ["主框架打开", "新标签打开"],
                btn: ["确定", "取消"]
            }
        },

        backup: {
            label: "请选择您要还原的设置数据",
            btn: ["还原", "备份", "导入新驱动", "导入新模块"]
        },

        webAlarm: {
            title: ["网页弹窗报警", "网页语言报警"],
            option: ["开启", "关闭"],
            btn: "保存"
            
        },
        energyTab: {
            label: ["机房", "监控项", "未加入的监控项", "已加入的监控项"],
            btn: ["加入", "移除", "保存"],
            son_table_th: ["全选", "名称", "所属设备", "所属类型"],
            tips: [
                "无数据"
            ],
            type_option: ["IT功率项", "物理基础设施", "电能项", "输入功率项"]

        },
        TimingTask: {
            tips: ["请选择测试对象", "新增对象不能对比"]
        },
        linkage: {
            prompt:{
                title: '越限命令'
            }
        }, 

        software_Btn: ["保存", "上传", "修改", "还原"],
        software_label: [
            "帮助文档",
            "登录页LOGO（宽：155px 高：50px）",
            "主页LOGO（宽170px 高 60px 建议使用白色）",
            "公司信息",
            "监控系统"
        ],
        software_edition: ["大榕树标准版", "自定义版", "默认中性版", "远洋定制版", "塞克瑞德版"],
        software_prompt: {
            title: "版本切换",
            content: ["即将切换至", "版本，是否确认？"],
            btn: ["确认", "取消"]
        }
    },
    Prompt_btn: ["确定", "取消", "新增"],
    laypage: ["首页", "尾页", "上一页", "下一页"],
    Tips: [
        "删除完成！",
        "修改完成！",
        "保存完成！",
        "联系人组不能为空",
        "新增成功",
        "删除成功",
        "更新成功",
        "至少选择两项进行操作",
        "密码格式错误，至少六位的字母+数字组成",
        "邮箱格式错误",
        "号码有误",
        "参数不能为空",
        "至少勾选一个联系人组",
        "请先加入设备",
        "请保证每个参数都至少选择一项"
    ]
}   
export default cn;